In [1]:
import pandas as pd


# Drop Duplicate Rows

#Example 1:
#Input:
+-------------+---------+---------------------+
| customer_id | name    | email               |
+-------------+---------+---------------------+
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 5           | Finn    | john@example.com    |
| 6           | Violet  | alice@example.com   |
+-------------+---------+---------------------+
Output:  
+-------------+---------+---------------------+
| customer_id | name    | email               |
+-------------+---------+---------------------+
| 1           | Ella    | emily@example.com   |
| 2           | David   | michael@example.com |
| 3           | Zachary | sarah@example.com   |
| 4           | Alice   | john@example.com    |
| 6           | Violet  | alice@example.com   |
+-------------+---------+---------------------+

SyntaxError: invalid syntax (837067162.py, line 6)

In [8]:

import pandas as pd

customers = {'customer_id': [1,2,3,4,5,6], 'name' : ["Ella","David","Zachary","Alice","Finn","Violet"], 'email' : ["emily@example.com","michael@example.com","sarah@example.com","john@example.com","john@example.com","alice@example.com"]}
      
      
      
customers_df = pd.DataFrame(data=customers)

customers_df.head()

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com

In [10]:
customers_df.drop_duplicates(subset="email", keep="first", inplace=True)

In [11]:
customers_df.head()

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com